MikroElektronika/core_packages/PIC/XC8/def/PIC16CR926/mcu.h
// Register: PMCON1
#define PMCON1 PMCON1
extern volatile unsigned char           PMCON1              __at(0x10C);
#ifndef _LIB_BUILD
asm("PMCON1 equ 010Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
    };
} PMCON1bits_t;
extern volatile PMCON1bits_t PMCON1bits __at(0x10C);
// bitfield macros
#define _PMCON1_RD_POSN                                     0x0
#define _PMCON1_RD_POSITION                                 0x0
#define _PMCON1_RD_SIZE                                     0x1
#define _PMCON1_RD_LENGTH                                   0x1
#define _PMCON1_RD_MASK                                     0x1

// Register: LCDSE
#define LCDSE LCDSE
extern volatile unsigned char           LCDSE               __at(0x10D);
#ifndef _LIB_BUILD
asm("LCDSE equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SE0                    :1;
        unsigned SE5                    :1;
        unsigned SE9                    :1;
        unsigned SE12                   :1;
        unsigned SE16                   :1;
        unsigned SE20                   :1;
        unsigned SE27                   :1;
        unsigned SE29                   :1;
    };
} LCDSEbits_t;
extern volatile LCDSEbits_t LCDSEbits __at(0x10D);
// bitfield macros
#define _LCDSE_SE0_POSN                                     0x0
#define _LCDSE_SE0_POSITION                                 0x0
#define _LCDSE_SE0_SIZE                                     0x1
#define _LCDSE_SE0_LENGTH                                   0x1
#define _LCDSE_SE0_MASK                                     0x1
#define _LCDSE_SE5_POSN                                     0x1
#define _LCDSE_SE5_POSITION                                 0x1
#define _LCDSE_SE5_SIZE                                     0x1
#define _LCDSE_SE5_LENGTH                                   0x1
#define _LCDSE_SE5_MASK                                     0x2
#define _LCDSE_SE9_POSN                                     0x2
#define _LCDSE_SE9_POSITION                                 0x2
#define _LCDSE_SE9_SIZE                                     0x1
#define _LCDSE_SE9_LENGTH                                   0x1
#define _LCDSE_SE9_MASK                                     0x4
#define _LCDSE_SE12_POSN                                    0x3
#define _LCDSE_SE12_POSITION                                0x3
#define _LCDSE_SE12_SIZE                                    0x1
#define _LCDSE_SE12_LENGTH                                  0x1
#define _LCDSE_SE12_MASK                                    0x8
#define _LCDSE_SE16_POSN                                    0x4
#define _LCDSE_SE16_POSITION                                0x4
#define _LCDSE_SE16_SIZE                                    0x1
#define _LCDSE_SE16_LENGTH                                  0x1
#define _LCDSE_SE16_MASK                                    0x10
#define _LCDSE_SE20_POSN                                    0x5
#define _LCDSE_SE20_POSITION                                0x5
#define _LCDSE_SE20_SIZE                                    0x1
#define _LCDSE_SE20_LENGTH                                  0x1
#define _LCDSE_SE20_MASK                                    0x20
#define _LCDSE_SE27_POSN                                    0x6
#define _LCDSE_SE27_POSITION                                0x6
#define _LCDSE_SE27_SIZE                                    0x1
#define _LCDSE_SE27_LENGTH                                  0x1
#define _LCDSE_SE27_MASK                                    0x40
#define _LCDSE_SE29_POSN                                    0x7
#define _LCDSE_SE29_POSITION                                0x7
#define _LCDSE_SE29_SIZE                                    0x1
#define _LCDSE_SE29_LENGTH                                  0x1
#define _LCDSE_SE29_MASK                                    0x80

// Register: LCDPS
#define LCDPS LCDPS
extern volatile unsigned char           LCDPS               __at(0x10E);
#ifndef _LIB_BUILD
asm("LCDPS equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LP                     :4;
    };
    struct {
        unsigned LP0                    :1;
        unsigned LP1                    :1;
        unsigned LP2                    :1;
        unsigned LP3                    :1;
    };
} LCDPSbits_t;
extern volatile LCDPSbits_t LCDPSbits __at(0x10E);
// bitfield macros
#define _LCDPS_LP_POSN                                      0x0
#define _LCDPS_LP_POSITION                                  0x0
#define _LCDPS_LP_SIZE                                      0x4
#define _LCDPS_LP_LENGTH                                    0x4
#define _LCDPS_LP_MASK                                      0xF
#define _LCDPS_LP0_POSN                                     0x0
#define _LCDPS_LP0_POSITION                                 0x0
#define _LCDPS_LP0_SIZE                                     0x1
#define _LCDPS_LP0_LENGTH                                   0x1
#define _LCDPS_LP0_MASK                                     0x1
#define _LCDPS_LP1_POSN                                     0x1
#define _LCDPS_LP1_POSITION                                 0x1
#define _LCDPS_LP1_SIZE                                     0x1
#define _LCDPS_LP1_LENGTH                                   0x1
#define _LCDPS_LP1_MASK                                     0x2
#define _LCDPS_LP2_POSN                                     0x2
#define _LCDPS_LP2_POSITION                                 0x2
#define _LCDPS_LP2_SIZE                                     0x1
#define _LCDPS_LP2_LENGTH                                   0x1
#define _LCDPS_LP2_MASK                                     0x4
#define _LCDPS_LP3_POSN                                     0x3
#define _LCDPS_LP3_POSITION                                 0x3
#define _LCDPS_LP3_SIZE                                     0x1
#define _LCDPS_LP3_LENGTH                                   0x1
#define _LCDPS_LP3_MASK                                     0x8

